def convert(rear):
    convertList = {"라":"나","락":"낙","란":"난","랄":"날",
    "람":"남","랍":"납","랏":"낫","랑":"낭",
    "략":"약","량":"양","렁":"넝","려":"여",
    "녀":"여","력":"역","녁":"역","련":"연",
    "년":"연","렬":"열","렴":"염","념":"염",
    "렵":"엽","령":"영","녕":"영","로":"노",
    "록":"녹","론":"논","롤":"놀","롬":"놈",
    "롭":"놉","롯":"놋","롱":"농","료":"요",
    "뇨":"요","룡":"용","뇽":"용","루":"누",
    "룩":"눅","룬":"눈","룰":"눌","룸":"눔",
    "룻":"눗","룽":"눙","류":"유","뉴":"유",
    "륙":"육","률":"율","르":"느","륵":"늑",
    "른":"는","를":"늘","름":"늠","릅":"늡",
    "릇":"늣","릉":"능","래":"내","랙":"낵",
    "랜":"낸","랠":"낼","램":"냄","랩":"냅",
    "랫":"냇","랭":"냉","례":"예","뢰":"뇌",
    "리":"이","니":"이","린":"인","닌":"인",
    "릴":"일","닐":"일","림":"임","님":"임",
    "립":"입","닙":"입","릿":"잇","닛":"잇",
    "링":"잉","닝":"잉"}
    
    if rear in convertList:
        return convertList[rear]
    return rear